// Задача: Написать программу, которая из имеющегося массива строк формирует новый массив
// из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести
// с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется 
//пользоваться коллекциями, лучше обойтись исключительно массивами.
// Примеры:
// [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
// [“1234”, “1567”, “-2”, “computer science”] → [“-2”]
// [“Russia”, “Denmark”, “Kazan”] → []

/* решения:
Делаем перебор значений из исходного массива
Проверяем каждое значение из массива на соответствие условию: длина строки меньше или равна трем
Если строка удовлетворяет условию кладем значение в новый массив
Повторяем пункты 2 и 3 до тех пор пока не достигнем конца исходного массива
Возвращаем новый заполненый массив как результат /*


